In [13]:
import pandas as pd
from sqlalchemy import create_engine

In [14]:
#Store INDUSTRY CSV into DataFrame
csv_file = "Resources/industry_employment.csv"
industry_data_df = pd.read_csv(csv_file)
industry_data_df.head()

,"Annual industry employment movements, 2016-17 to 2018-19",Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,2016-17 ('000),2017-18 ('000),2018-19 ('000)
1,"Agriculture, forestry and fishing",-9,-14,-8
2,Mining,-7,12,10
3,Manufacturing,-7,10,14
4,"Electricity, gas, water and waste services",1,3,5

In [15]:
##  Rename the column headers
industry_data_df = industry_data_df.rename(columns={"Annual industry employment movements, 2016-17 to 2018-19": "Industry",
                                                          "Unnamed: 1": "2017",
                                                          "Unnamed: 2": "2018",
                                                          "Unnamed: 3": "2019"})

## Clean the data
industry_data_df=industry_data_df.dropna(how='any')
industry_data_df.head()

                                     Industry 2017 2018 2019
1           Agriculture, forestry and fishing   -9  -14   -8
2                                      Mining   -7   12   10
3                               Manufacturing   -7   10   14
4  Electricity, gas, water and waste services    1    3    5
5                                Construction   14   47    4

In [16]:
# dropping duplicates and setting the index
#industry_data_df.drop_duplicates("Industry", inplace=True)
industry_data_df.set_index("Industry", inplace=True)

industry_data_df.head()

                                           2017 2018 2019
Industry
Agriculture, forestry and fishing            -9  -14   -8
Mining                                       -7   12   10
Manufacturing                                -7   10   14
Electricity, gas, water and waste services    1    3    5
Construction                                 14   47    4

In [17]:
#Store EMPLOYMENT CSV into DataFrame
csv_file = "Resources/Industry_EBITDA.csv"
earnings_data_df = pd.read_csv(csv_file)
earnings_data_df.head()

,"Annual industry EBITDA movements, 2016-17 to 2018-19",Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,2016-17 ($m),2017-18 ($m),2018-19 ($m)
1,"Agriculture, forestry and fishing","3,694","-2,258",-998
2,Mining,"23,313","21,399","33,746"
3,Manufacturing,"-1,064","4,201","3,346"
4,"Electricity, gas, water and waste services","3,254",481,670

In [18]:
##  Rename the column headers
earnings_data_df = earnings_data_df.rename(columns={"Annual industry EBITDA movements, 2016-17 to 2018-19": "Industry",
                                                         "Unnamed: 1": "2017",
                                                          "Unnamed: 2": "2018",
                                                          "Unnamed: 3": "2019"})

## Clean the data
earnings_data_df= earnings_data_df.dropna(how='any')
earnings_data_df.set_index("Industry", inplace=True)
earnings_data_df.head()

                                              2017    2018    2019
Industry
Agriculture, forestry and fishing            3,694  -2,258    -998
Mining                                      23,313  21,399  33,746
Manufacturing                               -1,064   4,201   3,346
Electricity, gas, water and waste services   3,254     481     670
Construction                                   435   3,404   2,504

In [28]:
#  create database connection
connection_string = "postgres:postgres@localhost:5432/CourseOption_db"
engine = create_engine(f'postgresql://{connection_string}')

In [29]:
# Confirm tables
engine.table_names()

['industry', 'earning']